package classtest;

// 객체 : 속성(변수), 기능(메서드) ==> 코드로 나타낸 게 클래스
// 일반적으로 속성, 생성자, 기능 순서

// 관계 : 상속(확장) or 포함
// 상속 : 오버라이딩, 다형성

// final : 클래스(상속 금지), 메소드(오버라이딩 금지), 변수(수정 금지)

public class Total {
	// 속성 : 기본타입, 참조타입(배열, 클래스 등)
	//		대부분 속성은 외부로 보여지지 않게 감춤 (private)
	//		상수의 개념으로 들어오는 경우 static final 대문자=초기값;
	
	
	// 생성자 : 여러 개 가능 (생성자 오버로딩) -> 다양한 방법으로 객체 초기화 가능하게 하려
	//		목적: 객체 초기화, 객체를 생성하며 해야 할 사전 작업
	
	
	// 메소드 (중요!) : 반복 작업이나 특정 기능을 제공할 때 작성 및 사용
	//				특히 get~(): 값을 내보낼 때, set~(): 값을 변경하거나 초기화할 때
	//				주로 외부에서 접근 가능하게 작성 (public)
	
	
}
